# Import Libraries

In [2]:
#import libraries
import pandas as pd
import numpy as np
import os

# Import Data

In [3]:
#folder path
path = r'C:\Users\kanch\Documents\10-08-2023 Instacart Basket Analysis\02 Data\Original Data'

In [4]:
# import customers
df_customers = pd.read_csv(os.path.join(path,'customers.csv'))

In [5]:
#folder path
path = r'C:\Users\kanch\Documents\10-08-2023 Instacart Basket Analysis\02 Data\Prepared Data'

In [6]:
#3 import orders_prods_merged
df_ords_prods_merge = pd.read_pickle(os.path.join(path,'orders_products_merged.pkl'))

In [7]:
df_ords_prods_merge.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices
0,0,2539329,1,prior,1,2,8,0.0,196,1,0,both,Soda,77,7,9.0
1,1,2398795,1,prior,2,3,7,15.0,196,1,1,both,Soda,77,7,9.0
2,2,473747,1,prior,3,3,12,21.0,196,1,1,both,Soda,77,7,9.0
3,3,2254736,1,prior,4,4,7,29.0,196,1,1,both,Soda,77,7,9.0
4,4,431534,1,prior,5,4,15,28.0,196,1,1,both,Soda,77,7,9.0

In [8]:
df_ords_prods_merge.shape

(32434212, 16)

In [9]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# wrangling customer dataset

In [11]:
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [13]:
#checking for blanks or nan values
df_customers['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [14]:
df_customers['STATE'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: STATE, dtype: int64

In [15]:
df_customers['Age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [16]:
df_customers['fam_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [17]:
df_customers['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [18]:
df_customers['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [19]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [20]:
#changing a lot of column names in customer
df_customers.rename(columns = {'First Name' : 'first'}, inplace = True)

In [21]:
df_customers.rename(columns = {'Surnam' : 'last'}, inplace = True)

In [22]:
df_customers.head()

,user_id,first,last,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [23]:
df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [24]:
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [25]:
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [26]:
df_customers.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [27]:
df_customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [28]:
df_customers.head()

,user_id,first,last,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [29]:
#changing the data type to string for user id in customers df
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [30]:
#changing the data type to string for user id in ords_prods_merge df
df_ords_prods_merge['user_id'] = df_ords_prods_merge['user_id'].astype('str')

In [31]:
df_customers['user_id'].dtype

dtype('O')

In [32]:
df_ords_prods_merge['user_id'].dtype

dtype('O')

In [33]:
df_ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434212 entries, 0 to 32434211
Data columns (total 16 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0              int64
 1   order_id                int64
 2   user_id                 object
 3   eval_set                object
 4   order_number            int64
 5   orders_day_of_week      int64
 6   order_hour_of_day       int64
 7   days_since_prior_order  float64
 8   product_id              int64
 9   add_to_cart_order       int64
 10  reordered               int64
 11  _merge                  category
 12  product_name            object
 13  aisle_id                int64
 14  department_id           int64
 15  prices                  float64
dtypes: category(1), float64(2), int64(10), object(3)
memory usage: 3.9+ GB

In [34]:
#checking for missing values again
df_customers.isnull().sum()

user_id                     0
first                   11259
last                        0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
marital_status              0
income                      0
dtype: int64

In [35]:
df_customers['first'].value_counts(dropna = False)

NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: first, Length: 208, dtype: int64

In [36]:
#looking for duplicates
df_dups = df_customers[df_customers.duplicated()]

In [37]:
df_dups

Empty DataFrame
Columns: [user_id, first, last, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

# merging customers and ords prods merge df

In [38]:
#dropping merge column
df_ords_prods_merge = df_ords_prods_merge.drop(columns = ['_merge'])

In [39]:
df_ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434212 entries, 0 to 32434211
Data columns (total 15 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0              int64
 1   order_id                int64
 2   user_id                 object
 3   eval_set                object
 4   order_number            int64
 5   orders_day_of_week      int64
 6   order_hour_of_day       int64
 7   days_since_prior_order  float64
 8   product_id              int64
 9   add_to_cart_order       int64
 10  reordered               int64
 11  product_name            object
 12  aisle_id                int64
 13  department_id           int64
 14  prices                  float64
dtypes: float64(2), int64(10), object(3)
memory usage: 3.9+ GB

In [40]:
#making a subset of nan values in first name
df_nan_1 = df_customers[df_customers['first'].isnull() ==True]

In [41]:
#checking it out
df_nan_1

,user_id,first,last,gender,state,age,date_joined,number_of_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [42]:
# seeing the total number in original df
df_customers.shape

(206209, 10)

In [43]:
#making a new DF dropping the Nan values
df_customers_clean = df_customers[df_customers['first'].isnull()==False]

In [44]:
# checking the rows to make sure it is 11259 less -- it is!
df_customers_clean.shape

(194950, 10)

In [97]:
#exportdata

exportpath = r'C:\Users\kanch\Documents\10-08-2023 Instacart Basket Analysis\02 Data\Prepared Data'

In [99]:
# Export data to pkl

df_customers_clean.to_pickle(os.path.join(path,'ords_prods_all_updated.pkl'))